# LegendComponent Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..LegendComponent Property
ParameterTypeId Class See Also
---
"Component Type"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId LegendComponent { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property LegendComponent As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ LegendComponent {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace